describe('тестирования функции возведения в степень', () => {
    // it('возведение 2 в степень 3', () => {
    //     assert.equal(pow(2, 3), 8);
    // });
    // it('возведение 2 в степень 4', () => {
    //     assert.equal(pow(2, 4), 16);
    // });
    // it('возведение 2 в степень 5', () => {
    //     assert.equal(pow(2, 5), 32);
    // });

    // for (let i = 1; i <= 15; i++) {
    //     it(`возведение 2 в степень ${i}`, () => {
    //         assert.equal(pow(2, i), 2**i);
    //     });
    // }

    // for (let i = 1; i <= 10; i++) {
    //     for (let j = 1; j < 10; j++) {
    //         it(`возведение ${i} в степень ${j}`, () => {
    //             assert.equal(pow(i, j), i**j);
    //         });
    //     }
    // }

    for (let i = -5; i <= 10; i++) {
        for (let j = 1; j < 10; j++) {
            it(`возведение ${i} в степень ${j}`, () => {
                assert.equal(pow(i, j), i**j);
            });
        }
    }


    it('Возврат сроки error при передаче на вход строк', () => {
        assert.equal(pow('test', 'test2'), 'error');
    });
});